# устанавливаем официальный образ Node.js
FROM node:24-alpine

# указываем рабочую (корневую) директорию
WORKDIR /app

# копируем основные файлы приложения в рабочую директорию
COPY package.json package-lock.json ./

# устанавливаем указанные зависимости NPM на этапе установки образа
RUN npm ci

# копируем остальные файлы проекта
COPY . .

# собираем приложение
RUN npm run build

# Указываем, что контейнер использует порт 3000
EXPOSE 3000

# запускаем основной скрипт в момент запуска контейнера
CMD npm start